app/controllers/api/tours_controller.rb

SELECT "tours".* FROM "tours"
---
    def index
        @tours = Tour.all

SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @tour = Tour.find(params[:id])