app/views/api/tours/index.json.jbuilder

        :language, :price
        json.photoUrls tour.photos.map { |file| url_for(file) }
---
SELECT "tours".* FROM "tours"