app/models/user.rb

    def reset_session_token!
      self.session_token = SecureRandom.base64
      self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "RbIZyqIVMJe6vCycDWNCjw=="], ["updated_at", "2020-03-02 22:31:38.599274"], ["id", 3]]